CSI API ETABS v1

# cPointObjGetMass Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetMass(
    	string Name,
    	ref double[] M
    )

    Function GetMass (
    	Name As String,
    	ByRef M As Double()
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim M As Double()
    Dim returnValue As Integer

    returnValue = instance.GetMass(Name, M)

    int GetMass(
    	String^ Name,
    	array<double>^% M
    )

    abstract GetMass :
            Name : string *
            M : float[] byref -> int

#### Parameters

Name

    Type: SystemString

M

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com